Revit 2026 API

# Face Class

---

A bounded face of a 3d solid or open shell.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBFace More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Face : GeometryObject
```
```vb
Public Class Face
	Inherits GeometryObject
```
```cpp
public ref class Face : public GeometryObject
```
```fsharp
type Face =
    class
        inherit GeometryObject
    end
```

The Face type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | The area of this face. |
|  | EdgeLoops | A collection of edge loops. Each edge loop represents one of the closed boundaries of the face. |
|  | GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle(Inherited from GeometryObject) |
|  | HasRegions | Identifies if the face contains regions (which can be created, for example, by the Split Face command). |
|  | Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.(Inherited from GeometryObject) |
|  | IsCyclic | Indicates whether the underlying surface is periodic in the specified parametric direction. |
|  | IsElementGeometry | Indicates whether this geometry is obtained directly from an Element.(Inherited from GeometryObject) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | IsTwoSided | Determines if a face is two-sided (degenerate). |
|  | MaterialElementId | The element ID of the material from which this face is composed. |
|  | OrientationMatchesSurfaceOrientation | Returns true if this face's orientation matches the orientation of the face's surface, false if they have opposite orientations. |
|  | Period | The period of the underlying surface in the specified parametric direction. |
|  | Reference | Returns a stable reference to the face. |
|  | Visibility | The visibility.(Inherited from GeometryObject) |

|  | Name | Description |
| --- | --- | --- |
|  | ComputeDerivatives | Returns the first partial derivatives of the underlying surface at the specified point. |
|  | ComputeNormal | Returns the normal vector for the face at the given point. |
|  | ComputeSecondDerivatives | Returns the second partial derivatives of the face at the specified point. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from GeometryObject) |
|  | Evaluate | Evaluates and returns the XYZ coordinates of a point at the indicated UV parameterization of the face. |
|  | GetBoundingBox | Returns the UV bounding box of the face. |
|  | GetEdgesAsCurveLoops | Returns a list of closed curve loops that correspond to the edge loops of the face. Curves in each curve loop correspond to individual edges. |
|  | GetHashCode | Gets the integer value of the geometry object as hash code (Inherited from GeometryObject) |
|  | GetRegions | Gets the face regions (created, for example, by the Split Face command) of the face. |
|  | GetSurface | Returns a copy of this face's surface. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Intersect(Curve) | Calculates the intersection of the specified curve with this face. |
|  | Intersect(Face) | Calculates the intersection of the specified face with this face and returns the intersection results. |
|  | Intersect(Curve, IntersectionResultArray) | Calculates the intersection of the specified curve with this face and returns the intersection results. |
|  | Intersect(Face, Curve) | Calculates the intersection of the specified face with this face and returns the intersection results. |
|  | IsInside(UV) | Indicates whether the specified point is within this face. |
|  | IsInside(UV, IntersectionResult) | Indicates whether the specified point is within this face and outputs additional information about the point location. |
|  | Project | Projects the specified point on the face. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | Triangulate | Returns a triangular mesh approximation to the face. |
|  | Triangulate(Double) | Returns a triangular mesh approximation to the face. |

Faces are defined by surfaces (Surface) bounded by edge loops. The surfaces provide natural UV parameterization to the faces.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBFace Autodesk.Revit.DBConicalFace Autodesk.Revit.DBCylindricalFace Autodesk.Revit.DBHermiteFace Autodesk.Revit.DBPlanarFace Autodesk.Revit.DBRevolvedFace Autodesk.Revit.DBRuledFace